node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 3160099
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "L\337\003>\227\201\003\276\375&\006\2754\225w>*\345\000\2758\003\202\274\370\025r>\325y#>E\376\'>\'\343C>\372\242\311<\243,T=\003\014\315=\325\037->\207-\234\275\237\376\t>]\232,>\026\322n>\225)\355=r\226+\276 LJ<5V\024\276\356\236\336\273/\375q\274\300\022\327\275?S\365\274~\000\301<\301\267\235<\013\034\346<o\2613>\217r]>\270\026\250=\\K\026\276\327\002b\275\327\244\232=\346\230\377=G$\306<\221\272R\276=\215w>LW\227\275\312\315\353=\231j\302=\027=\r\276(\254\374=\355\365\313\2736-\201=\273\363\214<O2\340\275\310\270\212=,+\004=\005[V>\237BZ\275\223A\037\276\345\356\335\275W\200\222>JQ\320=[[<\276\337:\244\275\3337\031=\226\322\203=_\202\263<\204|W\276\000\341\231=-g\206\275\3405T\2764\322\217\274c\262\311=7\3656=\246\352\270\275\017\340\202\276\306d\222>\331\361\365\275\207\2329\276G\204K=\315f\204=5\223\032\276\327\005\336=b9\324\275e`\365=wSA>\024{L=\001\357&>\261\324\232=\335\006\177>\031\024\202=\324\030\374<\316\016\224\274\304\273\275\275\272\324\264\274\351IK\2754\3528\275\262fT>\337\241[=H\354\265\274\343<+=\347/J>\303\0142=?N\332\2753\233\233\273]\217\224\274M\203\266\2744Lr>\032\243\306\275\312\307\303=\207\325S\276Q\250\202=O-Z>f\212\032>\2271\303<\212\252\007>4/B>\265\253\003>\302\252c\275\260\014N\274M-{<\234\353\337\275 \274\335=\347\006\003>\241(?>\302\2202>\223\372\270\275\234\021\345\274\343zA\276\"HG>9aV\276\275\024J>\001(\344<\242\250\270\275:lJ=R\\\321=\032y%\2753\351\323<F-A>\263-\262\275\372q\n\276C\316x<\213=\270=3\n\035\276\200\n=\275\2154\252\274\352\225\031\276\001\205\016\275\211\027\031\275\352\354\245<\204\345\357<\303\340\227>\321x\277\275\177\363\271\274\343 \022=\024\266I>\241\177\013\276\221\251\314<\301\245\213=D+\347=\367P/<\376D\274\275\214V.<)\263\232>\237\201\221=|K\254\275K\236y\275\356?z>\355=\305\275\211\301\022>\241\001j>g\t\312\275\340\366/>\001\272\375<\t\241\305\272\303\017\376=Jm\310\275^;\035>y\204j=\340\367e\276\215)\315=\234\331:\276o1\335=;\0307=\037d\303=\",a\276\361A\222\276\260\260n\276}\r\3139\0065\226<\226\355\364\274\206\2031\275\315\013i=\020\311\010>[\223\254=e\322\200<\020g?\275\020\306\236\276\227\310p\274K\243\030\276\252\217\022\276Y\352\036\275\3630\002<U\255z\275\333Zl\275T\n5\276\311\211U\274\213\370\\=\350\374\345=\036l\237\275\305C\350\274\217\273\270\274v\213\241=\353?\200\276\2712\242=\330\213<=\331\261\260\276%\360\371\275\333\351\204<\314\335\243\275&r\224\275\374\023\335\274\214Iw\275\327I@\276L\211q>\251\372.\276\325&7\276x\227\020\275\363!~=\360:\33192\375n\275d\247\276;\370\321\310=C9\026\276\367\342\203:E\031\225\276zQ\006\275\200\206\010=\0238\315\275z\315\024>\347~\035\276\024u\305\275,-K\276\312u\252\275\304\336\315=\177\352\030\275\271\0146\275D\301\373\275\211\005:>\244\003/\276\256\217E=\337\320(\276\3054w\276J[\234<Q\017\202\275=\217\n=\nI\242\275\242(\352\2753\021@>\224t\244;p\301\264\275\010\005\337==+\034>\260\214\\=jh\233=\376\364\352=\333TS>`M5=\264\010\261\275\201\022\007>\3005\260\276(\323\217=\314\004\263\274\335-\253;\024\362;>B\335\253<\026\013\\<\rs\254\276\221\354\312\275Q\002\374\274\222\233\017\276\330\010}=J0\254\275n\364\250=2\275G\275H\312g>.\331\270=\007\222\024>\224A\t\276R\222\014>t\322\000\276!?\'\276T\205\004>\222\317\260=\336b\253=\200\364\306=\371w\001=\334\354\021>K\254\226<+~\370=\031\224\340<\024\032\013>1\350I\275\220\352\225\275\364\203q\275p`c\276!\314+\276\264(\267\2754\313\300\275\337\221\013\2760\324\t=K\337\223=\344[\264\275I9\303<\276\313_>\344\324\326\275\356.P>G^$\275\316_\314\275`\364\341=\026\020\034<\225\240\266=u\313\343=\303\362O\275QW\350=\006j0\276\346\005\231\275/\234\013=$\271\005\276\211\002o\2761\356\221:\007&\333=G\021\336\274\217C\356<\245\353\r=T&K\275\335$\022>Uq&\276\020\2008>\036%z\275F\267H=\314\240->\023iV\275\240\260\362\274\320e\244\275b\306\331=M-\256\275\343W\036>\206\364\016<\225S#\275\035s\234<\350s>=7l]\276\262\327\241\276\315\\\210\276\005\305\001>\321C+=\231\206t>\023\210D\276#\2632\276\362\0328\276\004cT=\220\030B>5\374\331\275\247)\034\276\325\177\023=\276?b=\\\213}\275S\264\327\274-R\346<p\271P=\355\306\312\275\220W\016\275\237\304W>X\234\202>G%?=g\223X=\244}\373=\204\216H\276\017yo<\255t\\<\300\222\272\275\304\275{\275N\217T\276\360\277\n\276yD\366=\217b\031\276\035\354\341\275c\371|\2760@%>\002\345\376<\347\240\216=\226\020\265\275\237D\257=Q\344@\275\321\204B\276\247\216\\=3s!\275m\035\r>\2520\256\274\275t\235=\"(\376\274\261C$\276\210Kd\276L\006B\275\274\013\335\275\250\205\312=sw\342\275x\363\367=\220\202(=^\302\217>\351$\337\275\266\027\205>\263\306Y=\027\310\344=\330\2118\275\000\227\217>G\350*>\341\214\354=I\326O=\333\323`\275\037.U=\367\207\377\275B\\\326\275\242\001\353\275\217\374I\276\372\313V\275\030\2741=\307\320\">\021\243\277<\216fu\276\"\310\323\275M\243\247=\236\017g>\323\3450>59\001>?\223\267\275:\247\225\274\237\013\267<\356C\253\276\367\222c=\035\305\325:\264O\350=\201\223L=\256\020\314\275\223*\311<[\311\373=\2071\342\2758\335D>\340\272/\275\'\303)=e\254s\274\007\330Q>\270\310\326=\317(\037\274_a\200\275\032\310,>\240\217G\274\201\316\244=\345\374j>IYa\275\203\216\331=\334\372u=\031\305\207<\345\337\005\273\252\205\271\275\014\"\007=6u\274\275\375W\225\275%\215@>\331\035\035\274Y\265\\=B\367N\276\253\344!>t\"2\275\360\351\223=a\'\253\275\224\007\216>\"\257\214>v\2132\275\331!G\276 \036@=(2|=OvJ\276l\305\345=\217I%>:\363E\2751\010\022;\005\370\221<X\002\313\274\304j=\274\347\311\253=\225T\013\276\034\325\233=9\206h>f$\334\275i\370\323\274-l6>\204G\255\275$/\303\275\313c\006\275\r{@\276\226-4>\352\032\323=\"\2232>\207C?\275W\330\266\275\370f\206\275%\340,>\233P\252=\312\371#\276\335n\304<\342s~\2746\371<>a\204\002>o\002A\276\212\350\327\275S\312\357=\376\3108>\376\'\031>\020\217G\276{\346-\276W\232T;\251sy\274\007+\203\275\270\032\361=\367\001w>+\303\212<k\207.\274\262LW>\367\272\356<\035\327\226>\270\340\351=!\377q\275\205\251T=\247% \276\246\313w\276\276\312\017\276\332\244\221\276\212{4=d\375\227=\3368~\275\030\323$<\037\006z=$\313\310\275\277\203\023<d`4>\354\244\270<\312\255i\275CVr\275\226j\257=\321b\357=G-Z>uD\3779^\005\243\275\3270G=&\226\253=>\264t\275t\026\372<\265~\202\275\343~E<\204\017\311\275\241\273\345\275\016~\">9\331;\275\210W\207\275\312Io>p\t\020<\273\252\357<\264a\021\275\233\021R\275\300\370\031>KP+\276\177>\310\272[\241\200>:\267?\275Z\014y\274\037v)\276r\000\n>\307\307\236>V\347\213>kc\240\275Y\353\353=\023f\234<\304g\004=\360\262k\275\216\342i=\2563\313\275J\357\240>C\262\307\275\223\364P\276q\332\210=FK\240>\234\033\"<\320\202\324\275xV0>\202M\275\272hR\331\274\275\333\345\275TF\230\275\206eH\275\360\272+= \317\250<+n\206\276\333\254%=\311\274\365\274Zm\337<\311/1>7\022\352\275\307wg\276~\224Y\275\350\374\250\275\337\2065>\370\232\263;\210\370\021\274\035\273\037\274\307j\021>\341\344\037<\242c\301=t\023\214\276\026\306\370;64\345=\032\236\224<Jo8<\256\276\330\276\300f0<i3?\276\316\264t=\027\232O\275]\207\n=NG\010\276\264\000n\276\235\275\353\275\365\237\254\275\217b\036>\301X\003\275XU\021>\362B\374=\223\n\253\275\275\302\222\275R\357C=\033\276.>\005a\037\276\235O\237;!\t\251=\r\360\224=\255\3047\276b\305\250\274lr\376\273\305\205\177>t\335d\275e\256F>\013\023\270=.b\022\275\317\202\304\275.2\325\275\nB\226\274\007E\265\2759\020K\275+7r\273?\206\221=D%\321=\3241T>^\221\332=\027j~\275\271\022V\276\22063>\235Y\033\2766\201\212\274\275rS=\231\246\205>\306\351z\275l\235s\272\032\032>=\340\205\311<\264@\231\275\275;]<Z{\207\274\021\303\352=\321\340#>\310\030\340=\237\034\224\276Y\267\253=o\376\316\275\026e\005\276\t\314\354\275\302\336*=Uo\014>\205\315\302=\206\"\222\276\226\375Y=\031\327E\275\3613\t\275\'\305\360\2757Wz\275\352I\253=\024,\">6\t*>\004;!=\246\016\364;\036n\226\276\207\215\272\274\253\234S>\014zi\275\031\016\337\275k1\'>\377\202\317\275ZM\023\276\233\262\376\275\237D\260<5\371\277<\244\320\376=\0250\205=\224\346b\275\336\202 >(\360\277=\306h\367\274\'\347\340=gK\201=\017\227\275<&{\002<k\'\201\275-Ia=\224\3248\276m\265N>\345+\253\276\244\017\t=\311\270\n\276Cw\211>R*x\275nL\006><\022\037=\255\355\002=\374\226\273\275\263B\206\275\246\352r<U\321\r\276\006p\326\275LW\256=\372\260\243\275\347\036\005<\345\021\255\273\264\341\260\275\025\275\206;\031S,;\0353\351\275v\007\263\276\001c\316\275\210\333\237=ph\264\275\027\367\337\275q\210\373\274\262l\343\275\204\203/\275\232\360\202<w\266Q\2764\267r=:\247;=\324\013d=E_|\276@\"9>x\214\226=(\271~>P\001Y>,K\263=\375\356\024\276\231$6>n\n\211\275^\223\224\276\361\303*=\354c =\354\313\037\275\325\203\241=\335A\">(\353\203=\300\304\300=\260]\366=\031F\226\275\241<\035\276\021\0149\275\216\217\226\276\311\n\377\275\316g\024=\240\261\253\275(U\024\276\356\031\\=\216\024\350\275\016@\234;+\033y\275\n\213\021\276-\023u=\034]\203<\343\311\010\275\300RK<_\021\251;\321]\306\275\213\227\314;<\331\346\275\261(e=&\331\003\276m\216\263\275\247\334\205=\375\262&\276\310\256v>\215F\201\275d\241\216>\023\256\346\273\252Q\347\275\207<\r>\246\250\303\275\323\233\351\275H\213\332\273\243<\224\274\347T%\276\'\244\367\275\327\231`>\346\246\210=\237wc>[\334\273=!\306d\273L\216\303\275U\354\202\276\374\373\315<lP\333\275\310\202\205\275\177\177I\276\321\205\374=5\010\204=\000\204\270\273e:\211\275\202\346\321=\234\211w\275& \021><\305\221\276\342+?>\374um>My\210\273\304]1>\347\246\350\274#\364/=\313k}\275\nb\233>\034\017\264=c\355\014>\245?\230\275z\315\367=\227h\305=-\374\305=\215\rj\275\233\314\032\276\006X;\275v\\K\275\364\246\377\275\307\240`>\\u\312\275\303\372\232\276W\373\336=\351\365x=:\370\336\273\222\336\374\274K\237\371=\002\331\211=\033\371\361=\'\216\252\275\177x_\274\033t^=\274\265b\275\343\010Y\276=$\'>,\337\001\274v\361\034\276\315t,;\365f\034>z]\200=H\214\347\275\373\024\202<\332\350\206\275\357D\251\275`%\224\275cU1\276\205\340 >\245l\373=\207\254:>\007\2432>\265\r\205=\362G@\276\216\360L>&\252\327;g\246n>\326\216\372\2759&\324\275\016\266H\275\210\310\272\275)\0062\276O\246->\004g,\276~\030p\275V~\243=\212\257#<Psa\276\362h\t>\253w\211\275\016\355\033\275\253h\225\275\327P+>\314\220\201\276\023\277\023=\336|5>\303\201\222>\356\303\022>-\316\206\275\235\272\310\275x\366\222\275}%\227\276\024\314`>|-\\=\022\354\242=k\372\255<\243\212O=\000\031\360=L!V\276\235\327\225\275{\023B>\202}\036\276\"?/>d\2608=%\257\231\275\031\024\013\276FL\031>\3158\321\274Xj5\275\351|9<\021V?=\242Oc\276\307O\351\274\230\343\371\275\003y\035\2759\357|\275\243\266\255=\331\325\374\274:dL>\354\000\274:\251/\207<\351\264\322<\225W\205=d*\237\275\002\0169\276\177%\334\275\210\204\235=\344>\207\274\342\216\026\276\321\3301>\244\005\251=\027vO\276\247R`=\364\212\335=\241\250\327<\237\275<\275\211\220\226>\270\3140>\301\001#>\026\246\331=\300-3>V\'\374:Fj\322\275I\233%\275\323\343\303<\362u\025\2762-q=\224\276\200=K\'f>],\214<0,\226\275SX\035\276\035B\337\273i\211\022\276J)\330\275|\361\375=S\213\261\275\034|\003=z\033\255\275\n\202\">\020\333S>#2\216\276\272\273\024\276=\245\034>\2772\277:[\224\216=\025\022\030\276\3575\262\275\215\342R\275\"\312~\276\222\250\033>\245\3670>x\241\016>\343\0346>\251](=p\305\242=\366z\004>2\265W>E\372\243\274\356\022\n>\201\322\361=\007\351\025>\324^\252>\252\361\325\275Q<)\275a/\252=\237\242V>1\341\037\275\220\223\276=\006\326\266=\335y\336<\254V\271=R:}<c \334=\364\036x\275\377e4=\031\226\365\275A\232\020>\304\327\237\275r;\357=\310n\023\276\366\333O=a3.<\023\300\002>\225m|\275\272\247\251\2759\244\251>\036\205\216<\207\324\205\274\237_\206>\313\303\235=\325\240\240=\345\301\274\275\375I\271\275\345\233\261\275\222z\024\276\r7h\275\233,\360\275\327\272\310\275\270V\312<\367\347\001>r\305\365\273\234C\355\275+h1\276B\354T\275`\301\177\2762\270\200\276\350\231\274<D\202\257\2750[\t\276\201\271F\276\313\001|=\023\230\006\275\302:\030\276\315ym\274V\214\204=\226\r\230\275\3411\000>\t\201\200\276)2\343\2758\312H\2758\371\014\276VLQ\275%\322\356\273\034\241w\275*K\245=\240)\262=\305E\223\276\305\2126\276w\243\310=B\302\253\275)X\336;Y\342\007={I!>\023m>=\325\366\206<\215p(>\343\006\204\276/p\335=\232\345\225\275X\343K\275\241\314\026>\n\n9\275\3603\272\275\336\246\202=\035\003\333\274\213}\303\274\356\330\345=d\030\362<s\307\n=\275\000\362\275:\204\023>\363\013C<a\243 \275\304\201\230\276[\314\246\274\021M.\274\205\330\251\274\302xV\276\243E\203>h\204)\275Q:\331\275\267f$\275\323\360\365\272\245\035\">\361\353\250>\353\332!> \274\003=\327\325\357<\204\310-\276Y\253\014<\323\231\201\276\227yG>\025\227J\276$\237\016\276\364\360\013>C\260\346=9F\004:\341\214)>\000j\264=\333v\007\276w\354\303\274\027=^\276d\216\216\274s\301M>\266\312s=4\241t\2754\337\030\276N\302:>\215}\000>/\363\324\275\314g\255\273>\325\022=\317=\007=\375\346\312=\312\207\022\275\315q\200;\341eA\276:?*>\023\373g=\247\245\375=\"\024\n\276\373\003l=d\205\005\275\312\235\375=\357d\241\275\037\367)\276\332\235\235\275|\026\326\275\334\265\200\275\254\'\256=\266\377\023\275\365Eq\274H\365\244\275\303W:\276\024\377A>\332\000\335:\217\376\320<\357\\\215\276<\272\021>\221J7>\221\r+\275;\211\373\275&\345\241\275/*\354\274\t\033\214=\276\264\316=\211y\244=\006=\205\275&\217e>\"Q\227\275zR\240\275\246V/\276\330\213\341\275\226&\203>x\226\021>cG;>d\303\027>\371\225o=\362:\261\275\337|\261;\006\\\336<}\307!\274\22054>\317\241-\276\337\277\340;\013\216N\275\222\340\006\276\350G\233\276;R}\276\\B\013\274\022\337D\275\013\264T>\340\221\211\276\322aw<5 !<aB\276\274i\245\311\274\356+3\276@Y\247;\321\264\350\275b\025\342\272u{\263\275\260\014\263="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
