node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 5848233
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\350\253\230\274\215\n\251=\235\2579=\006\302\372\275\362\260Q<$\1776>b|x\2767XZ=\242c\340<=\344X\275\246\033\002\276d\346\230\274\207\030\213>3\363\251\276\325\036\351\275f\332\272=dH\343=0k\034>\267}:\276\213P`\275\207:\020\274\243\0372\275I\267\004>\014[\327\275\320#\254=\350\2326\276s@\026\274\314\017\004>,T0\276r\376\306=\200? \274\013\357\334=v\004\366\274\274xq\276?\037}=\370,\034=\032-J\275[\027k\275\223\363\373=a\214\033=\341Y\037\276]\351\204>\246\3567>\007\363\025\276\";\003\274\276i\224\275U#\023\276\326D\314<\371\002\003>\t\213\212\275v\301w\274\344$\301\275\016\370\214\276\001%\314\275\006|\323\275\022k\306=\275\274\026\276\314Y\253=\035\222e=~O\">y\251\216\275\255q\374=\247DG>\230\377\207\276\231Q\n\275UU\203=A\337\262=OG\360=\271\233j\276\370\313\304\273r\023\000>\251\217E>\327zc>\336n\020>\267\202\273<\374\274\235;\305\373\360=\337\315\361\274\006\206C>52\237=\006mL\275\377\244\337\275,\022C\275\256\016\001\276\020\276G=\363\371x\274\333\366\216\275\030\321\216\275b \025\275\342It>\220\317\262\275\021\315R\276\233\031\267\276\275\306V=\346\222H\276F\277\253=\033d:\276.\220\241:(\316\371<\362\263\027>\306\007\026=\264\216\270=\306*,>le\001\276\027\023]\274\014\223\205<\204\005\230=zn\241<\323\2544\275\232e-\275\334\030\234=\372\215V>s\242\236=!\305\224=\324\332\036\275U\200\017\276\0014\014\273\313\265\200\2767\377\362=/\370\202\275\016\"Y\275\363\224\032=N8a>\275\216@\273\236\217\235=\221\355>\276\235\000\307\275\312\300\013\276\202\331\205\274\306J|<\246X\337\273\002\202\205\275\343B\235>\364\264\265\276;\356t\274\231\007\203\275\217\364\360=\261Ed=\321\325\224=\261\211\020>\317?\211<\344\331\033>\225\333e\275\255o\236=\207\260\352\275\246\2360>Zzn=rZi<\243\362\214<4N*>\r\246K\275w\233\211=\314 \245=\357*\315=\200\251\245\274veB\276\001\214%\274\201_\357<\311\371\331=J>\023\276J?\373\274\243\325$\2761x\177=\371t@\276\342\336\214=\3734\036>]\375R>p-\262\275\217\320\206\275\217\033\341\2740\"\022\276\\\262\032>n\004\254>T\020\331\275\235\203\330=\252\374A>\343W}\274B\361\227=.>>\276\361\324U=\322>\014\276\201N\340<\244\264\362\274?\250X\275\246\026\271\274\371z\277=\023\032&\276\301\255\033>P\360\356\275H%\013>yE>\275f\237\r>c\014\220\274^\356\310<@\257?\275\t\250\016>1\211\277=\324\355x>V\334!\272\312\325A=\000\013\211=P9M\275\263\275q\276+\277\204>\2314\350=\205X\215>\306\261\327<\266\2078>\363<\334=\352\022\214\276\"O\220=\326\356\032\276\271\264\000\276\271\352\272=[\0356\276}\257\024\276GO\013>\023\331\227\276\r\004\204=Tw\326\275c\253\300\2748}\205\274?\372!\275\007\205i\274?N\327=\361\n\250<\364\272;>\303\360\306\275Sb^=nsQ>\362k\212\275\221E\345\275(\036\t\276\r\230\250\275S\225K\276\\\212\375<u\021\000=\354\2368=C3\r>\222s\010\275\325\347\264=\321\310~\275\304\177\234\275U\317Z\274\204PS\275K\267\255\275\211U\365=\345\305\316\275)\0053>2\221\356=\010\022\242\276\375_\354=\300\210\001=\370Y\r>\342\252;>83]=\347\377\201>\231(\002>`\225K\276\233\032\251=\014*\230>~\222\007\276\233\321\013=9\247\n\276\035\273\244;\313f\256\275Er<\276\241p =\200\312\002>\364\330&\2751\276\203<\032\"\021\276\320\243\027\276P\246\001\276\3630\235=\247\313\220\274\254 \023\276\2359\224\275\005\220\t\276ua\311\275\006\276\036\276\333mN\276\023\232o\275\\ol\275\243\266\267=6\226.=\230u\001\275\332\357\302=&\373\035\276x\037\246<\271\350\250;\006N0>C\210r\275|)\224\276:\003\014>\355\271\206\275\361u\270<\253\312\227\275\227\364\030\276\tm\014>\240F\344\274\303Rk\274\202\244V\275\372\241\231\275%\251\300=v5\272\274\253\233\225\276\334\201\037\276Q\336H>b49\276x`E>p`\022:\274p`\274\356\214\377\274\351\226^\276\032\341\224>7\323\336=\255RA\275\246\230\322=\237w\301=\355]\004\276\262\227\345\275_\364\357\275J{\253\275\004f\254;\374\300\t\276x\356\212\275\315`\026>\2070\013\273\212\363\376\275\362\241\271\275\245\335\320\275}u\315\275KFg< \025\305\274\277\3108>\023k\230=Qv\363\274\211\301\020\276Y\315\205\274\024\344\202\276\361f\020\276M.c\276\006^v\274A\254\357<\010\347\323=\001\002\201=\217\210\307\275\332\1771=T\361\236\275,\345\217\273\225X\240=\362\231O\275\363\332\300>\'_\375=|u\263\275d\363\205\2744\371\242<i\305r\276\347\315a<\313\274\013;\033wN\276\364\032/;\244\310\334=\214\337\353=\366C\354\274\276\353\377\274\227\321\267\275\344\255\246\276,\325Q\275\321\201\007\276p\375\270=\201}\357\275\365\334\230\275\233\243\221\274\232t\303=\005pN\275V\207\352\275\032O\244\275\332\037\334\274\177\256\037\273\323\t\207=l\322b\276\0252L\276\244/N>\255\273E\274\275W\351=\310\215F=gE\271>\014\266\316=\261x\371\275#Bo=\2436u=\340\251\360\275\211\324\251<};\332\2745\330\006\276n,P=M\005\257<v\\\026\274\272\353(\276lw2\276\321_3>\361\007\264=4\260\017\275\333\201\311\274S\360\033=\330\232\333\273/D\262\275\215\007\357=\214\303\261\275i\034\013\276%r;=,\024\374=\323\276\320<\3226q\275\217\210\336\276\325\213\316\275\340\245\036>]\320\212<Z\270\224<\2344\010>\257E\202=\244I\213=i\253\227\2766\343\217\275\267\201i\275\211U\036\276\025\210x=\211\363\'\276\367\035\215=\016\271\207>\242@\003\275\246\331P\275#\327^>\314\240L>aC(\276\030D\251\274\235\263g\276\370$8\274M\327\017>\360AS\275\354\315Q>\310)\023=S\3669\275:|\273=\263\217@<\021\307\215\275\342%\336\275?\217@\276_\346m\275\223\374\210\276W\337\346=y\330\335=\014\360\341\274\236\267\203\275\210\034\010\276_\317\203=\223~,>[J\316=j\357\372\2754\335\006>Q\355\346=\246Eq\275\036?W\276\275\257\364\275\264(j<\001o\235\275t<{\275VL\001>x\006Z\276\276\201S\275u+>>K\034\025>?%\224\275\372\245\037\276\021\"\004\275\334\306\261=\337\023\235\275|1\217=C\241\003>\013J+<0\323\033\276\036j2\274EN\263\274`\346j=:\234\252=\237z\227>\345\253\256\276\361Y\266=\364R1>\270J\367\275C\235\027>\323l\277\274\221q\003\276\275\257j=\320\021\004=\216\357\217=O\3404=0\314\225\275})\372<\365$\250\275R\326J\275\252\357\265=Y8I\276\322&\023\2768(\237\276\355\003\032\275\261\013\252=\340\250\247\276!\274\003\276\230\210\n>\304x;>\007U\203;\376\345I\274.\014A<\326\021X<\226\345\273\27540\256=\313\217\213=\304\313\253\275\341z\222\275\332\0338>c\222Z=L|I\276\301\264\306\275\016\205\335\275\215S\310\275\373\n\220\275<\213\305=8\223\272=\322\3413>\234\244\305=\236\302U\275%\201\013>Tv\347\273i\264J\275\314\271\223;/J\\\2761\357\305=\302\232\351=\016\344\357\275\322h\331=\262\361\036\276\243{B<\240eY\275}g\216=n\005\375=\000\311\260>\002\314\250=\210<\331<\324\352\311\275J\266>\275\003\327%<_\314\205=\373\3450\276\371g\337\275\177<\205=Ij[=q,K=7\305Z\276\250-\333=K\2324>,\341\333\275\202\244\362\271$\020m\275i\232\267<\211c\251\275\362\247\335=)%\321\276er\316\275\267\2107=\314\241\304\275\035\374h\275\'\037-\276\225 \';\224\316\233\274\237\037-\275\273\2310\275\341\336\033=$\nJ\276\356\032\320<\227\211\217>\377\235\267<\235*\205\274NU\r>\366ov>~Z\026>\253\370\354\275\371D\340\275\276\307:\276\n\264\355;\347d+\275`\2709<C\207\n\276\037\3601>y)\025\276\251!\220\275\375\251\301<Ez\017\276\2527\r=Eko=\305+*>\353\341\002\275d\210R\274\035s\320<|\254\003>\347)4\276\337\247Q\275|R\227=d\205\243\275\002\317C>BQ\311<\261\327\325\274\027\3764\276m\267\314\275\226\272\216\275[N?\275\224\2038=+G\230>\204\240\202\275\016\340\205>\226_o\272cdg>;\360\203>U\357\005\276<-\311\276\323f,\275\273Z\031>\340b\023\276\254\036\364=\nrq\275\273\2050\275|v\361\275*Ey=j\214\231=\325\241\333<B\212M>\2446\340\275l\277\216<GrN>L\001\241=\320\234\225=\314\304@\276\027A\007\275.\246k;\312R\235<\036\327\036\276\345\031\026<Q\023\253<\232\276\025\275\276\375Y\276m\206\366\275\313\207\366<\002\354\026>O}H\275\232=h<[\203\013>\243\335\240\275d\211\202<F\022\204\274H\272\023>mc\033=\356\255(\275H\217\205=\240p\331\275\305\027\026>zi\236<\023\244\212=f\357|\275\232s\340\273\025\376\363\275\233\203g>\217\212\000> tU\275\036\007g\276\241\204d>\215X\325=>\023#\274k+)=\310\365?>\266{&>\330\234\002>\251\367\217\275\311\252?>\002\372\263\275\2358:>\374\322\271=\266\327\261\275\002Fh\276\354D)>\267\354\254\275\311\370\017=i\342#\276\3235\324=\221]\302\275@m\256=u\3612\275\222\247\033>`\034\032=-\333\213\2748\023\026\276\367\353\251\275[(a<mF\220\272\273S\261=\323\224\203\276\032\372\370\275~i4=\020&[>\262\"\021>\343\356\017<\352hP>\275\024\253>i\002\230\275kE\355\274xo\372\275\310\225\241\275\n\307\t>\314\213\274\275\020\n\377<\t\307\234=B\342\365<\2445\201\275\233\360z\276\372\251<=+\304\315;D\232&>\241I\233\275*p\033>\205n\264=\031\214\001\276\375\266C\276@\267\203\274\020\263/\276F\352\306\275\010\177\214\275\336\307\260=\370i\337\275Y}\356\274DUL>@E\206>\"4\004=\326\242\304<\227\320\310<\353\212\230<\250\247\362<\246\207\303=\316\266\020\276\002>\274=\266\022\273=\370\334}<\005(v\276\0250\226\274\304\267-<\364\336 >\351D\337<M\177*>\241l(\276\277\035\323<(v\227\2764\r\n\276o\026\250\275@\\\005=\272O\355<\370\371\255\276,\330L>1\300\362<%=\216>\224\023x<\254\360 \276\270G\337<\031SD>\276]\266\274\230\205\021>\373\346]=\203\\5\275K\243\204\275\370/\002=/\330\270=\353\265!\275\274\243q>P\235\302\274\007,\023\276;Z\031\276\275\3458\275\333^X>>\310\021\276\241\234\031>e9S>\241\333{\274\rD\203\275V\017I<\274\213\313=\222\\\236\275\255j\213>y\004[=\030\224\027>\202\354\325=\2643\373\275q\276\265\275@\200\211=\277j\"\275\244K\357\275[\214p<{\221\357=\251\312\037\276_\343q>\334\277\364=\245\343\261=x\321\225\276\016\343\017>e\210\t>\325\301\330\274\372\020 >\024\321\205=2\202\265\275S\342\342\274\002\265j\275\302\313Q\275Z\0161=\334\032\314=\"\330\004>j\\\017>fu\033\274\2568C>\013\017&; Z\000>\236\007\004>c1\304=\310c\304\2743\023<\276G\001d>\233\252\302=\206\201T\275\245\017\371;3\240H>@\363\037<\306\000\031>\007\214,>v1\273=\0275\216\275\251X\201=?\231\237\275\306\264/\275%I\204>\016%\340<\001\262\336\275\024\365\033>\341\223z\276u\344Z=\030\2341\276DL_\274\253\214\266\273\212\031\246=\212\371\007\276\375{\224>\222\007@=\010\227\271\275\003\025\202=\177\236z\276\2164\205=\003g\004\276F\237\310\2759\305\003>\203\221>=\267-[\275\314V\235\273$\264\225=\270J\362\274\203\240\013>2+\021=^%\350<$dF>QQ\273\275\013\205\365<\222ZY\276\021hD\276\024{E>\032\017\271=\304\315\356=\235\'{\276fbL\273\272\216\017>\312\253H\276\017\347o\276j\004\002=\267\353\333\275\353\344\244=\226D\037\276\360\217O\275\327\364\031\276\272W\207=\205\217\006\276\235\275\331<7o\t\276N\306\341=;\340\001<_\013\027=3\240>>\362ia\276\277\335D>\270\036\200=\350= \276\005\317\360\274\253)\n\276\267\362|\275\002\346\343\274QT\356\275\316\200\013\275#\203\355=4{\270\275\310\244\304\275\305\271G=\330*\254\275\"&K=\326\302\332=\022\tA\276y\310 \2753S\244=v\033\177=n\005\265=\241\230$\275\3242\017\276\322\333\005>\223\315,=\352\230\200\275\214l\023\276\312\035z<\351\277P\276\334h\031\275\035\231q=\212I/>6s\243\275#\274\004;\372\035\372<\316\360C\275\237b\226>\rn\325>]\251V\276\201B\024\276\205-\351=\251yq\276\3611\365==\242s=Q\025\316</\004\334=\001\345\267=\007\272\200\275q\264h\275X\331\301<\300i\r=cH0\276\241=}\2767\3562\275\327\'\013\275-\376\316=\020\372T\276v\224&;d}\227\274\333\310\235\276\203\035\275\273\340J\270\274\351\263\002=B1z\275;\334\003>\216\347\364=\322w\347\274\377\351\260=|\3708\276\307\315]\275\013\036\001\276\tfz\276HQ\337\275m<%\275\334\231\333<\201\016j\275+\023\333=k{\026>&?8=m\344\017=d+.\276`\025\332=\246\255\351\275;v\276=<\240{>},\001\276!\367\235\275\253\300&\274\347\315\234=@\272\255=\207\315c=\333\275><\340\2643\276\344\267X>\023L\363;\326j$<\tM\022\276\231:\224\274#[H\275S\256\370=6I\005\275\002\265\357=\216|\022\276\351\035\202\276#\254\213\274\002]\307=P\311\343\275\000\243\037>\304\321Q>\002W\004\275\2331\025>\0176\212\275\376E\364;j,\276\274\215S\345=\037\336\247\275\"\021\227\276L\265\202\276\224h=\276\275~\330\275\006|\243\276\252`\265=.\'\307\274\217\260\336=\342\352\213\275\234\337C\276\272\325g\275\250\273\022=lc\027>\330g\332\27346;\276b\263\270=\215\213\246=\224\226D\275\n\353\320=\214\271h\275\260|\273\275=%\212=\"=g=\206\031\376\275vG\200\272\353\344\301=<\341Z>\010\230g\276\321\255Y>\036`\032=\327@!>0Z\206\275\342\275\230\275I\373>>61\247\276bW\021=\010\023\031\276\313s\255=\377\256R>\350\312\250\275\201\233\003>\210\201J=\035\023\025>i\231\226<\340O\324\274\024z\035>\230\336\204=\265\206f<\231\223\033<\217\307\013\276\314II=\257\242\224\274\203\016\215=\006V\261=1\366\034\2766\302\234=\nM\021\276\327p,=\253\253\240\274\255\265\352\274}\352\234\276\234,\206;\221\255Z>\247\257\315<\31358\275YH\021\276;\214C\276a1\365;\372U\211\276\303\302\371\273h\241\201>M\320\360=\'\352!\276\302\325\204>\230\327]=+\315\211=`\2010\274\002\212\037>&\352\320=\344\356\261\274s\007\313=\347(\375;\014G\000\274\311E\020>%\313\007=F\372\373\274\320\244\222<\353\003\t>O\006\013>\031A\032>\320\250\253\2754\277s=\324\251\224=\215\346\261\275>\353%=\307\003\301\275\301\225\240\275\311\356\206>\364o\263\275P\252]=\022\362\010=\346$\323=\032\251U>}\210\035=\013y\364\275\354\031h>/\224\273:|R\353=?\261\036\275D,\367=[ }\275\260\266\241\274\rw\r\275^\024\004>\356K\207\276\221\003H\276\215H\232\274\245\344\271>\324\2640\275@\033\t>\360\230\222=\002\364Y\275\261HY\275B\305\204=\224[\033<Y\306V\276\031\nB=\272\335#\276\372\007N>\211\230\210\274 \331\005\276\262\372\353\274\257\326\">,\360J>\203\232\211\276\0377\240=\217&~\276\356\227\024>hL\235\274S\250K\276\303SL\275^9\235\275,EK\275\201\323E=~e\021\275\367i\026<n\024\322\275\212~\014>!\342\323=\262\250k\275\3321\016>_\370\203=\'0\310\275\n\020C>\207\315\"=\370\200\207\276\201l(>%\302\207=\206\276\030=+;\272\275u\1778>#\330\335=\303\211L;\374\221\035>\370\256\013\275\025\233\243=\022?\201=eJN>wK\243>D[m\275\330\356A\275\2034\325\274\331\\\235=\242\247\240\275\221Q{>\251&\375\275\017\007E=f\344\010=ZQ3\276*\224p\275*r~=knF=\304/\265<"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
